TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_СопоставлениеОбъектовВнешнихСистем/гкс_СопоставлениеОбъектовВнешнихСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_СопоставлениеОбъектовВнешнихСистем</name>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_Фрахт/гкс_Фрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_Фрахт</name>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ПланыРазгрузкиСудов</registerRecords>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.гкс_СтатусыСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацийФрахта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытияОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбработкиСудна</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВеса</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОчередностьОбработки</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиПОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причал</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропорцияСмешивания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_СопоставлениеОбъектовВнешнихСистем/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораДляТипаСсылки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПриложениеПриИзменении(Элемент)
	ЗаполнитьСопоставлениеПоСценарию();
КонецПроцедуры

&НаКлиенте
Процедура ТипСсылкиПриИзменении(Элемент)
	ЗаполнитьСопоставлениеПоСценарию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗадатьСоответствие(Команда)
	
	Отказ = Ложь;
	ДлительнаяОперация = НачатьУстановкуСоответствия(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ТекстСообщения", "Выполняется установка соответствия");
	ПараметрыОжидания.Вставить("Заголовок", "Выполнение операции");
	ПараметрыОжидания.Вставить("ВыводитьСообщения", Истина);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаданияСоответствия", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыВыбораДляТипаСсылки()
	
	КоллекцияИдентификаторов = КоллекцияДоступныхТипов();

	НовыеЗначения 	= Новый ФиксированныйМассив(КоллекцияИдентификаторов);
	НовыйПараметр 	= Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения);
	НовыйМассив 	= Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры 	= Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.ТипСсылки.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Функция КоллекцияДоступныхТипов()
	
	Результат = Новый Массив;
	ОписаниеОбъектовМетаданных = Новый Массив;
	ОписаниеОбъектовМетаданных.Добавить(Метаданные.Справочники.Номенклатура);
	ОписаниеОбъектовМетаданных.Добавить(Метаданные.Справочники.гкс_ТочкиМаршрута);
	
	КоллекцияИдентификаторов = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(
		ОписаниеОбъектовМетаданных);
		
	Для Каждого ЭлементКоллекции Из КоллекцияИдентификаторов Цикл 
		Результат.Добавить(ЭлементКоллекции.Значение);
		Результат.Добавить(ЭлементКоллекции.Значение.Родитель);
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат);

КонецФункции

&НаСервере
Функция ЭтоНоменклатураДляМорскойЛогистики()
	// TODO: дописать определение приложения для МЛ
	Возврат ТипСсылки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Справочники.Номенклатура);
КонецФункции

&НаСервере
Функция ЭтоТочкиМаршрутаДляМорскойЛогистики()
	// TODO: дописать определение приложения для МЛ
	Возврат ТипСсылки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Справочники.гкс_ТочкиМаршрута);
КонецФункции

&НаСервере
Процедура ЗаполнитьСопоставлениеПоСценарию()
	
	СопоставлениеОбъектов.Очистить();
	Если ЭтоНоменклатураДляМорскойЛогистики() Тогда
		ЗаполнитьСопоставлениеДляНоменклатурыМорскойЛогистики();
	ИначеЕсли ЭтоТочкиМаршрутаДляМорскойЛогистики() Тогда
		ЗаполнитьСопоставлениеДляТочекМаршрутаМорскойЛогистики();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеДляНоменклатурыМорскойЛогистики()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФрахтГрузы.Номенклатура КАК Ссылка,
	|	ФрахтГрузы.Номенклатура КАК ЗаменяемаяСсылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФрахтГрузы.Номенклатура) КАК Идентификатор
	|ИЗ
	|	Документ.гкс_Фрахт.Грузы КАК ФрахтГрузы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ФрахтГрузы.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	СправочникНоменклатура.Ссылка ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеОбъектов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеДляТочекМаршрутаМорскойЛогистики()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФрахтСклады.Склад КАК Ссылка,
	|	ФрахтСклады.Склад КАК ЗаменяемаяСсылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФрахтСклады.Склад) КАК Идентификатор
	|ИЗ
	|	Документ.гкс_Фрахт.Склады КАК ФрахтСклады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК СправочникТочкиМаршрута
	|		ПО ФрахтСклады.Склад = СправочникТочкиМаршрута.Ссылка
	|ГДЕ
	|	СправочникТочкиМаршрута.Ссылка ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеОбъектов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция НачатьУстановкуСоответствия(Отказ)
 	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;;
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.Вставить("ОжидатьЗавершение", Неопределено);
	ПараметрыВыполнения.Вставить("ЗапуститьВФоне"	, Истина);
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Приложение"			, Приложение);
	ПараметрыМетода.Вставить("ТипСсылки"			, ТипСсылки);
	ПараметрыМетода.Вставить("СопоставлениеОбъектов", СопоставлениеОбъектов.Выгрузить());
	
	ИмяМетода = "Обработки.гкс_СопоставлениеОбъектовВнешнихСистем.ЗадатьСоответствиеМеждуОбъектами";
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, ИмяМетода, ПараметрыМетода, УникальныйИдентификатор);
	
КонецФункции

#Область ОбратныеВызовы

&НаКлиенте
Процедура ПослеЗаданияСоответствия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ТекстСообщения = НСтр("ru = 'Установка соответствия выполнена успешно'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		ЗаполнитьСопоставлениеПоСценарию();
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'При установке соответствия произошла ошибка %1 %2'"), 
			Символы.ПС, Результат.КраткоеПредставлениеОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	Иначе // Выполняется/Отменено
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
